from operator import contains
from pydoc import replace
from re import search
from xml.etree.ElementPath import find

# help(str)

s = "고기를 한 번 잡아봐요"
# ---------------------------------------------------------
# 실습 1: 시작 위치 '고기를' 탐지
print(search("고기를", s, 0))


# ---------------------------------------------------------
# 실습 2: 한 -> 두 로 대체
# replace("한", s)
# print(s)

# ---------------------------------------------------------
# 실습 3: '잡' 글자 위치 탐지
print(search("잡", s, 0))
# find("잡", s)
print(s.find("잡"))

# ---------------------------------------------------------
# 실습 4: s의 2번째 글자 출력 - 완료
print(f"4) {s[1]}")

# ---------------------------------------------------------
# 실습 5: s에서 '봐' 글자 존재 여부 탐지
print(contains(s, "봐"))
# ---------------------------------------------------------
# 실습 6: s 내의 '글자 수' 출력 - 완료
print(f"6) {len(s)}")

# ---------------------------------------------------------
# ---------------------------------------------------------
# ---------------------------------------------------------
# ---------------------------------------------------------
# 받아온 문자열 덩어리 쪼개기
s = "홍길동, 30, 수원"
s_split = s.split(",") # "" 내용물 기준으로 쪼개서 리스트화.
print(s_split)
# ---------------------------------------------------------
# 앞뒤의 공백 날리기
s = "               데이터              "
s_strip = s.strip() # 공백 제거.
print(s_strip)

# 중간에 있는 것은?
t = "다 크 펫"
t_strip = t.strip()
print(t_strip)
# 이건 안 되네...

# ---------------------------------------------------------
# 이상한 글자 날리기
s = "??????????????피카츄???????????????????"
s_clean = s.strip("?") # "" 내용물 제거.
print(s_clean)

